DELETE FROM student_card;
DELETE FROM student;
DELETE FROM study_group;
DELETE FROM speciality;
CREATE TABLE IF NOT EXISTS speciality (
                                          id INTEGER NOT NULL UNIQUE PRIMARY KEY AUTOINCREMENT,
                                          name TEXT NOT NULL UNIQUE
);

CREATE TABLE IF NOT EXISTS study_group (
                                           id INTEGER NOT NULL UNIQUE PRIMARY KEY AUTOINCREMENT,
                                           speciality_id INTEGER NOT NULL,
                                           name TEXT NOT NULL UNIQUE,
                                           FOREIGN KEY (speciality_id) REFERENCES speciality(id)
);

CREATE TABLE IF NOT EXISTS student (
                                       id INTEGER NOT NULL UNIQUE PRIMARY KEY AUTOINCREMENT,
                                       name TEXT NOT NULL,
                                       family TEXT NOT NULL,
                                       father_name TEXT,
                                       sex TEXT CHECK (sex IN ('male', 'female')),
                                       birth_date TEXT
);

CREATE TABLE IF NOT EXISTS student_card(
                                            id INTEGER NOT NULL UNIQUE PRIMARY KEY AUTOINCREMENT,
                                            id_student INTEGER NOT NULL UNIQUE,
                                            start_date TEXT NOT NULL,
                                            end_date TEXT NOT NULL,
                                            id_group INTEGER NOT NULL,
                                            CHECK (start_date GLOB '????-??-??' AND date(start_date) = start_date AND date(end_date) > date(start_date)),
                                            CHECK (end_date GLOB '????-??-??' AND date(end_date) = end_date AND date(end_date) > date(start_date)),
                                            FOREIGN KEY (id_group) REFERENCES study_group(id),
                                            FOREIGN KEY (id_student) REFERENCES student(id) ON DELETE CASCADE
);

INSERT INTO speciality (id, name) VALUES
                                      (1, 'Фундаментальная информатика и информационные технологии'),
                                      (2, 'Прикладная математика и информатика'),
                                      (3, 'Программная инженерия');
INSERT INTO study_group (speciality_id, name) VALUES
                                                  (1, '301'),
                                                  (1, '302'),
                                                  (2, '303'),
                                                  (3, '304'),
                                                  (3, '305');
INSERT INTO student (name, family, father_name, sex, birth_date) VALUES
('Никита', 'Андронов', 'Алексеевич', 'male', '2005-03-12'),
('Данила', 'Бабин', 'Олегович', 'male', '2004-11-24'),
('Алина', 'Буянкина', 'Сергеевна', 'female', '2005-07-18'),
('Павел', 'Голиков', 'Александрович', 'male', '2004-09-05'),
('Константин', 'Гончаров', 'Дмитриевич', 'male', '2005-01-30'),
('Вадим', 'Еремин', 'Сергеевич', 'male', '2004-05-22'),
('Илья', 'Журин', 'Александрович', 'male', '2005-08-14'),
('Ильдар', 'Кармышев', 'Русланович', 'male', '2004-12-09'),
('Альвина', 'Кучина', 'Сергеевна', 'female', '2005-04-03'),
('Максим', 'Ларькин', 'Сергеевич', 'male', '2004-10-27'),
('Роман', 'Лемясев', 'Николаевич', 'male', '2005-02-19'),
('Максим', 'Лузин', 'Дмитриевич', 'male', '2004-06-11'),
('Михаил', 'Марьин', 'Вячеславович', 'male', '2005-09-28'),
('Вадим', 'Орлов', 'Дмитриевич', 'male', '2004-08-07'),
('Роман', 'Пьянов', 'Владимирович', 'male', '2005-11-15'),
('Михаил', 'Родионов', 'Николаевич', 'male', '2004-03-21'),
('Максим', 'Самылкин', 'Евгеньевич', 'male', '2005-10-02'),
('Максим', 'Сарайкин', 'Евгеньевич', 'male', '2004-07-16'),
('Александр', 'Сеничев', 'Сергеевич', 'male', '2005-12-25'),
('Сергей', 'Фомин', 'Олегович', 'male', '2004-02-28'),
('Данил', 'Харитонов', 'Витальевич', 'male', '2005-05-09'),
('Николай', 'Холов', 'Александрович', 'male', '2004-01-17'),
('Юлия', 'Хрипченко', 'Владимировна', 'female', '2005-06-30'),
('Максим', 'Чернов', 'Михайлович', 'male', '2004-04-13'),

('Егор', 'Гришуков', 'Витальевич', 'male', '2005-02-10'),
('Иван', 'Данькин', '', 'male', '2004-08-25'),
('Егор', 'Ермаков', 'Александрович', 'male', '2005-04-18'),
('Никита', 'Кармазов', 'Александрович', 'male', '2004-11-03'),
('Евгений', 'Китаев', 'Витальевич', 'male', '2005-06-12'),
('Александр', 'Колевин', 'Сергеевич', 'male', '2004-09-20'),
('Иван', 'Лоханов', 'Вячеславович', 'male', '2005-01-28'),
('Роман', 'Лукьянов', 'Александрович', 'male', '2004-07-09'),
('Константин', 'Маркин', 'Романович', 'male', '2005-03-15'),
('Дмитрий', 'Романов', 'Алексеевич', 'male', '2004-12-05'),
('Ирина', 'Соснина', 'Васильевна', 'female', '2005-08-22'),
('Максим', 'Тиосса', 'Николаевич', 'male', '2004-05-30'),
('Данила', 'Тужин', 'Олегович', 'male', '2005-10-17'),
('Никита', 'Учуваткин', 'Сергеевич', 'male', '2004-01-24'),
('Алексей', 'Шапошников', 'Алексеевич', 'male', '2005-07-07'),
('Ольга', 'Шиляева', 'Игоревна', 'female', '2004-03-14'),


('Андрей', 'Абатуров', 'Дмитриевич', 'male', '2005-04-11'),
('Иван', 'Агафонов', 'Сергеевич', 'male', '2004-06-22'),
('Александр', 'Арсенин', 'Игоревич', 'male', '2005-02-03'),
('Артур', 'Бабанин', 'Александрович', 'male', '2004-09-17'),
('Константин', 'Беляев', 'Владимирович', 'male', '2005-07-29'),
('Александр', 'Богданов', 'Сергеевич', 'male', '2004-11-08'),
('Михаил', 'Борисов', 'Алексеевич', 'male', '2005-01-20'),
('Алексей', 'Бочков', 'Вячеславович', 'male', '2004-03-15'),
('Данил', 'Будников', 'Олегович', 'male', '2005-08-05'),
('Евгений', 'Васильев', 'Александрович', 'male', '2004-05-12'),
('Даниил', 'Волков', 'Дмитриевич', 'male', '2005-10-30'),
('Андрей', 'Гаврилов', 'Романович', 'male', '2004-12-22'),
('Павел', 'Голубев', 'Сергеевич', 'male', '2005-06-09'),
('Артем', 'Горбунов', 'Иванович', 'male', '2004-02-14'),
('Антон', 'Грибанов', 'Михайлович', 'male', '2005-09-16'),
('Дмитрий', 'Демидов', 'Алексеевич', 'male', '2004-04-25'),
('Никита', 'Егоров', 'Витальевич', 'male', '2005-11-03'),
('Александр', 'Еремин', 'Сергеевич', 'male', '2004-07-18'),
('Максим', 'Жданов', 'Олегович', 'male', '2005-03-27'),
('Иван', 'Жуков', 'Андреевич', 'male', '2004-10-02'),
('Алексей', 'Зайцев', 'Дмитриевич', 'male', '2005-12-19'),
('Павел', 'Козлов', 'Сергеевич', 'male', '2004-01-08'),
('Андрей', 'Кузнецов', 'Владимирович', 'male', '2005-05-10'),
('Даниил', 'Лебедев', 'Александрович', 'male', '2004-08-23'),
('Александр', 'Логинов', 'Игоревич', 'male', '2005-02-28'),
('Арсений', 'Макаров', 'Андреевич', 'male', '2004-06-07'),
('Роман', 'Медведев', 'Сергеевич', 'male', '2005-09-04'),
('Артём', 'Морозов', 'Дмитриевич', 'male', '2004-11-21'),

('Роман',    'Аксенов',      'Михайлович',       'male',   '2005-01-15'),  -- Аксенов Роман Михайлович
('Дмитрий',  'Артемьев',     'Алексеевич',       'male',   '2004-07-02'),  -- Артемьев Дмитрий Алексеевич
('Дмитрий',  'Афонькин',     'Евгеньевич',       'male',   '2005-03-12'),  -- Афонькин Дмитрий Евгеньевич
('Роман',    'Гераськин',    'Геннадьевич',      'male',   '2004-09-28'),  -- Гераськин Роман Геннадьевич
('Олег',     'Доля',         'Альбертович',      'male',   '2005-05-19'),  -- Доля Олег Альбертович
('Максим',   'Забненков',    'Алексеевич',       'male',   '2004-12-01'),  -- Забненков Максим Алексеевич
('Роман',    'Кижаем',       'Петрович',         'male',   '2005-02-14'),  -- Кижаем Роман Петрович
('Никита',   'Киселев',      'Сергеевич',        'male',   '2004-04-09'),  -- Киселев Никита Сергеевич
('Владислав','Кочетов',     'Андреевич',        'male',   '2005-06-27'),  -- Кочетов Владислав Андреевич
('Роман',    'Кувакин',      'Александрович',    'male',   '2004-08-11'),  -- Кувакин Роман Александрович
('Ренард',   'Курмакаев',    'Анварович',        'male',   '2005-10-05'),  -- Курмакаев Ренард Анварович
('Ксения',   'Луковатая',    'Вадимовна',        'female', '2004-01-18'),  -- Луковатая Ксения Вадимовна
('Иван',     'Мигачев',      'Павлович',         'male',   '2005-07-22'),  -- Мигачев Иван Павлович
('Олег',     'Моисеев',      'Максимович',       'male',   '2004-03-09'),  -- Моисеев Олег Максимович

('Роман',    'Зубков',       'Сергеевич',        'male',   '2005-09-30'),  -- Зубков Роман Сергеевич
('Максим',   'Иванов',       'Александрович',    'male',   '2004-11-12'),  -- Иванов Максим Александрович
('Артём',    'Ивенин',       'Андреевич',        'male',   '2005-04-05'),  -- Ивенин Артём Андреевич
('Иван',     'Казейкин',     'Иванович',         'male',   '2004-02-23'),  -- Казейкин Иван Иванович
('Артем',    'Кочнев',       'Алексеевич',       'male',   '2005-08-17'),  -- Кочнев Артем Алексеевич
('Илья',     'Логунов',      'Сергеевич',        'male',   '2004-10-08'),  -- Логунов Илья Сергеевич
('Юлия',     'Макарова',     'Сергеевна',        'female', '2005-12-01'),  -- Макарова Юлия Сергеевна
('Сергей',   'Маклаков',     'Александрович',    'male',   '2004-05-14'),  -- Маклаков Сергей Александрович
('Наталья',  'Маскинская',   'Сергеевна',        'female', '2005-01-29'),  -- Маскинская Наталья Сергеевна
('Дмитрий',  'Мукасеев',     'Александрович',    'male',   '2004-06-18'),  -- Мукасеев Дмитрий Александрович
('Владислав','Наумкин',     'Валерьевич',       'male',   '2005-03-25'),  -- Наумкин Владислав Валерьевич
('Василий',  'Паркаев',      'Александрович',    'male',   '2004-07-07'),  -- Паркаев Василий Александрович
('Дмитрий',  'Полковников',  'Александрович',    'male',   '2005-09-14'),  -- Полковников Дмитрий Александрович
('Полина',   'Пшеницына',    'Алексеевна',       'female', '2004-11-27');  -- Пшеницына Полина Алексеевна
-- Группа 301 (id_group = 1) — 24 студента
INSERT INTO student_card (id_student, start_date, end_date, id_group) VALUES
                                                                          (1,  '2023-09-01', '2025-06-30', 1),  -- Андронов Никита Алексеевич
                                                                          (2,  '2023-09-01', '2025-06-30', 1),  -- Бабин Данила Олегович
                                                                          (3,  '2023-09-01', '2025-06-30', 1),  -- Буянкина Алина Сергеевна
                                                                          (4,  '2023-09-01', '2025-06-30', 1),  -- Голиков Павел Александрович
                                                                          (5,  '2023-09-01', '2025-06-30', 1),  -- Гончаров Константин Дмитриевич
                                                                          (6,  '2023-09-01', '2025-06-30', 1),  -- Еремин Вадим Сергеевич
                                                                          (7,  '2023-09-01', '2025-06-30', 1),  -- Журин Илья Александрович
                                                                          (8,  '2023-09-01', '2025-06-30', 1),  -- Кармышев Ильдар Русланович
                                                                          (9,  '2023-09-01', '2025-06-30', 1),  -- Кучина Альвина Сергеевна
                                                                          (10, '2023-09-01', '2025-06-30', 1),  -- Ларькин Максим Сергеевич
                                                                          (11, '2023-09-01', '2025-06-30', 1),  -- Лемясев Роман Николаевич
                                                                          (12, '2023-09-01', '2025-06-30', 1),  -- Лузин Максим Дмитриевич
                                                                          (13, '2023-09-01', '2025-06-30', 1),  -- Марьин Михаил Вячеславович
                                                                          (14, '2023-09-01', '2025-06-30', 1),  -- Орлов Вадим Дмитриевич
                                                                          (15, '2023-09-01', '2025-06-30', 1),  -- Пьянов Роман Владимирович
                                                                          (16, '2023-09-01', '2025-06-30', 1),  -- Родионов Михаил Николаевич
                                                                          (17, '2023-09-01', '2025-06-30', 1),  -- Самылкин Максим Евгеньевич
                                                                          (18, '2023-09-01', '2025-06-30', 1),  -- Сарайкин Максим Евгеньевич
                                                                          (19, '2023-09-01', '2025-06-30', 1),  -- Сеничев Александр Сергеевич
                                                                          (20, '2023-09-01', '2025-06-30', 1),  -- Фомин Сергей Олегович
                                                                          (21, '2023-09-01', '2025-06-30', 1),  -- Харитонов Данил Витальевич
                                                                          (22, '2023-09-01', '2025-06-30', 1),  -- Холов Николай Александрович
                                                                          (23, '2023-09-01', '2025-06-30', 1),  -- Хрипченко Юлия Владимировна
                                                                          (24, '2023-09-01', '2025-06-30', 1);  -- Чернов Максим Михайлович
INSERT INTO student_card (id_student, start_date, end_date, id_group) VALUES
                                                                          (25, '2023-09-01', '2025-06-30', 2),  -- Гришуков Егор Витальевич
                                                                          (26, '2023-09-01', '2025-06-30', 2),  -- Данькин Иван
                                                                          (27, '2023-09-01', '2025-06-30', 2),  -- Ермаков Егор Александрович
                                                                          (28, '2023-09-01', '2025-06-30', 2),  -- Кармазов Никита Александрович
                                                                          (29, '2023-09-01', '2025-06-30', 2),  -- Китаев Евгений Витальевич
                                                                          (30, '2023-09-01', '2025-06-30', 2),  -- Колевин Александр Сергеевич
                                                                          (31, '2023-09-01', '2025-06-30', 2),  -- Лоханов Иван Вячеславович
                                                                          (32, '2023-09-01', '2025-06-30', 2),  -- Лукьянов Роман Александрович
                                                                          (33, '2023-09-01', '2025-06-30', 2),  -- Маркин Константин Романович
                                                                          (34, '2023-09-01', '2025-06-30', 2),  -- Романов Дмитрий Алексеевич
                                                                          (35, '2023-09-01', '2025-06-30', 2),  -- Соснина Ирина Васильевна
                                                                          (36, '2023-09-01', '2025-06-30', 2),  -- Тиосса Максим Николаевич
                                                                          (37, '2023-09-01', '2025-06-30', 2),  -- Тужин Данила Олегович
                                                                          (38, '2023-09-01', '2025-06-30', 2),  -- Учуваткин Никита Сергеевич
                                                                          (39, '2023-09-01', '2025-06-30', 2),  -- Шапошников Алексей Алексеевич
                                                                          (40, '2023-09-01', '2025-06-30', 2);  -- Шиляева Ольга Игоревна
INSERT INTO student_card (id_student, start_date, end_date, id_group) VALUES
                                                                          (41,  '2023-09-01', '2025-06-30', 3),  -- Абатуров Андрей Дмитриевич
                                                                          (42,  '2023-09-01', '2025-06-30', 3),  -- Агафонов Иван Сергеевич
                                                                          (43,  '2023-09-01', '2025-06-30', 3),  -- Арсенин Александр Игоревич
                                                                          (44,  '2023-09-01', '2025-06-30', 3),  -- Бабанин Артур Александрович
                                                                          (45,  '2023-09-01', '2025-06-30', 3),  -- Беляев Константин Владимирович
                                                                          (46,  '2023-09-01', '2025-06-30', 3),  -- Богданов Александр Сергеевич
                                                                          (47,  '2023-09-01', '2025-06-30', 3),  -- Борисов Михаил Алексеевич
                                                                          (48,  '2023-09-01', '2025-06-30', 3),  -- Бочков Алексей Вячеславович
                                                                          (49,  '2023-09-01', '2025-06-30', 3),  -- Будников Данил Олегович
                                                                          (50,  '2023-09-01', '2025-06-30', 3),  -- Васильев Евгений Александрович
                                                                          (51,  '2023-09-01', '2025-06-30', 3),  -- Волков Даниил Дмитриевич
                                                                          (52,  '2023-09-01', '2025-06-30', 3),  -- Гаврилов Андрей Романович
                                                                          (53,  '2023-09-01', '2025-06-30', 3),  -- Голубев Павел Сергеевич
                                                                          (54,  '2023-09-01', '2025-06-30', 3),  -- Горбунов Артём Иванович
                                                                          (55,  '2023-09-01', '2025-06-30', 3),  -- Грибанов Антон Михайлович
                                                                          (56,  '2023-09-01', '2025-06-30', 3),  -- Демидов Дмитрий Алексеевич
                                                                          (57,  '2023-09-01', '2025-06-30', 3),  -- Егоров Никита Витальевич
                                                                          (58,  '2023-09-01', '2025-06-30', 3),  -- Еремин Александр Сергеевич
                                                                          (59,  '2023-09-01', '2025-06-30', 3),  -- Жданов Максим Олегович
                                                                          (60,  '2023-09-01', '2025-06-30', 3),  -- Жуков Иван Андреевич
                                                                          (61,  '2023-09-01', '2025-06-30', 3),  -- Зайцев Алексей Дмитриевич
                                                                          (62,  '2023-09-01', '2025-06-30', 3),  -- Козлов Павел Сергеевич
                                                                          (63,  '2023-09-01', '2025-06-30', 3),  -- Кузнецов Андрей Владимирович
                                                                          (64,  '2023-09-01', '2025-06-30', 3),  -- Лебедев Даниил Александрович
                                                                          (65,  '2023-09-01', '2025-06-30', 3),  -- Логинов Александр Игоревич
                                                                          (66,  '2023-09-01', '2025-06-30', 3),  -- Макаров Арсений Андреевич
                                                                          (67,  '2023-09-01', '2025-06-30', 3),  -- Медведев Роман Сергеевич
                                                                          (68,  '2023-09-01', '2025-06-30', 3);  -- Морозов Артём Дмитриевич

INSERT INTO student_card (id_student, start_date, end_date, id_group) VALUES
                                                                          (69,  '2023-09-01', '2025-06-30', 4),  -- Анисимов Даниил Алексеевич
                                                                          (70,  '2023-09-01', '2025-06-30', 4),  -- Антонов Кирилл Сергеевич
                                                                          (71,  '2023-09-01', '2025-06-30', 4),  -- Архипов Данил Владимирович
                                                                          (72,  '2023-09-01', '2025-06-30', 4),  -- Безруков Александр Дмитриевич
                                                                          (73,  '2023-09-01', '2025-06-30', 4),  -- Белов Иван Андреевич
                                                                          (74,  '2023-09-01', '2025-06-30', 4),  -- Беляков Алексей Сергеевич
                                                                          (75,  '2023-09-01', '2025-06-30', 4),  -- Богомолов Михаил Вячеславович
                                                                          (76,  '2023-09-01', '2025-06-30', 4),  -- Бородин Артём Олегович
                                                                          (77,  '2023-09-01', '2025-06-30', 4),  -- Васильев Никита Александрович
                                                                          (78,  '2023-09-01', '2025-06-30', 4),  -- Веселов Дмитрий Игоревич
                                                                          (79,  '2023-09-01', '2025-06-30', 4),  -- Волошин Александр Романович
                                                                          (80,  '2023-09-01', '2025-06-30', 4),  -- Гаврилов Павел Андреевич
                                                                          (81,  '2023-09-01', '2025-06-30', 4),  -- Герасимов Евгений Сергеевич
                                                                          (82,  '2023-09-01', '2025-06-30', 4);  -- Голубев Андрей Витальевич

INSERT INTO student_card (id_student, start_date, end_date, id_group) VALUES
                                                                          (83,  '2023-09-01', '2025-06-30', 5),  -- Горбунов Иван Михайлович
                                                                          (84,  '2023-09-01', '2025-06-30', 5),  -- Григорьев Арсений Алексеевич
                                                                          (85,  '2023-09-01', '2025-06-30', 5),  -- Демидов Максим Дмитриевич
                                                                          (86,  '2023-09-01', '2025-06-30', 5),  -- Егоров Даниил Сергеевич
                                                                          (87,  '2023-09-01', '2025-06-30', 5),  -- Ермаков Алексей Олегович
                                                                          (88,  '2023-09-01', '2025-06-30', 5),  -- Жуков Роман Александрович
                                                                          (89,  '2023-09-01', '2025-06-30', 5),  -- Зайцев Александр Владимирович
                                                                          (90,  '2023-09-01', '2025-06-30', 5),  -- Козлов Павел Игоревич
                                                                          (91,  '2023-09-01', '2025-06-30', 5),  -- Кузнецов Андрей Андреевич
                                                                          (92,  '2023-09-01', '2025-06-30', 5),  -- Лебедев Даниил Сергеевич
                                                                          (93,  '2023-09-01', '2025-06-30', 5),  -- Логинов Артём Дмитриевич
                                                                          (94,  '2023-09-01', '2025-06-30', 5),  -- Макаров Никита Вячеславович
                                                                          (95,  '2023-09-01', '2025-06-30', 5),  -- Медведев Алексей Олегович
                                                                          (96,  '2023-09-01', '2025-06-30', 5);  -- Морозов Михаил Алексеевич